[{"name":"Season 2: Episode 1","headline":"Patient experience, advocacy and immune toxicities","hosts":"Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with Dena Battle from KCCure- an evidence based, patient driven patient advocacy organization. Dena shares her deep insight on patient, caregiver experiences around toxicity symptoms and how we can learn from each other to improve patient outcomes. ","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394"},{"name":"Trailer","headline":"Introducing Checkpoint NOW- the podcast at the intersection of immunotherapy and toxicities.","hosts":"Dr. Afreen Shariff, MD, Endocrinologist, Duke Division of Endocrinology, Diabetes and Metabolism, Duke Cancer Institute","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394"},{"name":"Season 2. Episode 2","headline":"Thyroid disease in a cancer patient.","hosts":"Join hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest experts and  thyroidologists Dr. Trevor Angell and Dr. Anupam Kotwal about thyroid disease in cancer for patients and caregivers.","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394"},{"name":"Season 1: Episode 19","headline":"Immune Checkpoint Inhibitors in Special Populations","hosts":"Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they talk to oncologists Dr. Sharon and Dr. Nagash to learn about Immune Checkpoint Inhibitors in special populations.\nDr. Sharon is an accomplished Oncologist at the National Cancer Institute. He co-Directs immunotherapy trials at the Cancer Therapy Evaluation Program (also known as CTEP) and serves as an attending physician in NCI's Developmental Therapeutics Clinic. As part of his work in immunotherapy drug development, he has made a major effort to advance the understanding of immune-related adverse events, including the establishment of the Alliance-NIH irAE Biorepository. \nDr. Naqash, is an Oncologist with a focus on Early phase clinical trials, drug development and biomarkers in Immunotherapy. He is currently an Assistant professor of Medicine at the Oklahoma Health Stephenson Cancer Center. \n","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 18","headline":"Immune Mediated neuro toxicities (Part 2)","hosts":"Learn from the experts about the latest in immune mediated neurological toxicities. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest experts- medical Oncologist Dr. Kerry Reynolds, and expert neurologists Drs. Amanda Guidon and Leeann Burton from Massachusetts General Hospital for an informative and high yield discussion.\n\n\n","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 17","headline":"Autoimmune Type 1 Diabetes: Challenge for our patients and clinicians","hosts":"Learn from the experts about the clinical diagnosis and multidisciplinary management of autoimmune Type 1 Diabetes. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest experts and endocrinologists Dr. Ole-Petter Hamnvik and Dr. Le Min from Brigham and Women's Hospital Harvard Medical School and Dana Farber Cancer Institute for an informative and high yield discussion. ","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394"},{"name":"Season 1: Episode 16","headline":"Managing Immune mediated Adverse events from a trainees perspective","hosts":"Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with resident physicians Dr. Harsh Patolia, Dr. Nathan Hirshman and Dr. Michelle Ferriera who share their experience and tips for fellow residents in training on managing immune mediated adverse events. ","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394"},{"name":"Season 1: Episode 15","headline":"Neuro-toxicities from Immune checkpoint Blockade: Rare and complex","hosts":"Learn from the experts about immune mediated neurological toxicities. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest expert and Neurologist Dr. Andrew Mammen. \n\nAndrew Mammen, M.D., Ph.D., joined NIAMS as Muscle Disease Unit Leader in the Laboratory of Muscle Stem Cells and Gene Regulation in 2014. He obtained his medical degree and Ph.D. in neuroscience at Johns Hopkins in 2000, where he subsequently completed his medicine internship, neurology residency, and neuromuscular fellowship. Prior to his appointment at NIH, he was Associate Professor of Neurology and Medicine at the Johns Hopkins University School of Medicine. He co-founded the Johns Hopkins Myositis Center in 2007, where he continues to see myositis patients as an adjunct faculty member. Dr. Mammen and his colleagues at Hopkins discovered a novel form of autoimmune myopathy associated with statin use and autoantibodies recognizing HMG-CoA reductase, the pharmacologic target of statins. In addition to clinical studies involving myositis patients, his current laboratory research interests include defining pathogenic mechanisms in the various forms of autoimmune myopathy and understanding the role of myositis autoantigens in muscle regeneration.\n","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394"},{"name":"Season 1: Episode 14","headline":"Immune mediated Liver Toxicities","hosts":"Learn from the experts about the latest in Immune Mediated Liver Toxicities. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest expert and Transplant Hepatologist Dr. Lindsay King. \nDr. King is a Hepatologist, Assistant Professor of Medicine at Duke University School of Medicine. \n","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 13","headline":"Skin Toxicities from Immune Checkpoint Inhibitors (PART 2): Common and perplexing\n\n","hosts":"Hosts: Learn from the experts about the latest in Onco- Dermatology and Immune skin Mediated toxicities. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest expert and Dermatologist Dr. Adela Rambi Cordones. Dr. Cordones is a Dermatologist, Associate Professor of Dermatology at Duke University School of Medicine. She leads the Immunodermatology Clinic at Duke and is clinician investigator with an expertise in Autoimmune Skin Disease and Cutaneous Drug reactions. ","link_spotify":" https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394 "},{"name":"Season 1: Episode 12","headline":"Skin Toxicities from Immune Checkpoint Inhibitors (PART 1): Common and perplexing","hosts":"Learn from the experts about the latest in Onco- Dermatology and Immune skin Mediated toxicities. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest expert and Dermatologist Dr. Meenal Kheterpal. \nDr. Kheterpal is a Dermatologist, Assistant Professor of Dermatology at Duke University School of Medicine. She also directs clinical research in Melanoma and Non - Melanoma Skin Cancer at Duke Dermatology.\n\n","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 11","headline":"Onco-Nephrology and Immune Mediated Nephrotoxicities","hosts":"Learn from the experts about the latest in Onco- Nephrology and Immune Mediated toxicities. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest experts and Nephrologists Dr. Matt Sparks and Dr. David Ortiz-Melo. \nDr. Matt Sparks is a Nephrologist, Assistant Professor of Medicine and the Associate program Director for the Nephrology fellowship at Duke. He is also a well-known online celebrity nephrologist who is the program director of the nephrology social media collective internship and co-creator of Nephmadness.\nDr. David Ortiz-Melo is a Nephrologist and Assistant Professor of Medicine. Dr. Ortiz-Melo has created and directs the Onco-Nephrology clinic at Duke.","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 10","headline":"Immune Mediated Pulmonary Toxicities","hosts":"Hosts: Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest expert and Oncologist, Dr. Jarushka Naidoo about the complex and challenging diagnosis of Immune mediated Pneumonitis. Dr. Jarushka Naidoo is currently a thoracic oncologist at Beaumont Hospital, Royal College of Surgeons of Ireland and she is also the national lead for lung cancer for Cancer Trials Ireland, and serves as an adjunct professor at Johns Hopkins University. She also serves on the NCCN guidelines committee for the management of immune-related toxicity, and runs an institutional multidisciplinary team for immune toxicity management.","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 9","headline":"Immune Mediated Cardiac Toxicities: Diagnostic challenges, management and novel discoveries. ","hosts":"Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest expert Dr. Javid Moslehi, MD, Cardiologist, Associate Professor of Medicine and an expert in immune-mediated cardiotoxicities at Vanderbilt University. Dr. Moslehi is also the Director of Cardio-Oncology at Vanderbilt.","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 8","hosts":"\nLearn from the experts about the latest in scientific trials and novel therapies in the pipeline for management of  Immune Mediated Colitis. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest experts- medical Oncologist Dr. Kerry Reynolds, Gastroenterologist/ Immunologist Dr. Micheal Dougan from Massachusetts General Hospital and rising star resident Dr. Nazli Dizman from Yale for an informative and high yield discussion.\n\n","headline":"Immune Mediated Colitis- Novel discoveries and novel therapies \n","link_spotify":" https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394 "},{"name":"Season 1: Episode 5","headline":"Immune mediated Myositis and Myalgia's: Diagnosis and management for the non- Rheumatologist","hosts":"Hosts: Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest expert and Rheumatologist Dr. Sophia Weinmann about the complex and challenging diagnosis of Immune mediated Myositis and Myalgia's","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 7","headline":"Immune Mediated Colitis and lessons learnt from multidisciplinary team based management. ","hosts":"Learn from the experts about the clinical diagnosis and multidisciplinary management of Immune Mediated Colitis. Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest experts- medical Oncologist Dr. Kerry Reynolds and Gastroenterologist/ Immunologist Dr. Micheal Dougan from Massachusetts General Hospital for an informative and high yield discussion. ","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394"},{"name":"Season 1: Episode 6","headline":"Rheumatic adverse events: Discussions on pre-existing rheumatic disease, biomarkers, collaborations and more. ","hosts":"Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest experts and rheumatologists Dr. Leonard Calabrese and Dr. Cassandra Calabrese from Cleveland Clinic and Dr. Alexa Meara from Ohio State University about budding collaborations and scientific discovery in Immune Mediated Rheumatic Adverse Events","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 4","headline":"Immune mediated Inflammatory Arthritis: Challenges in diagnosis and management ","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","hosts":"Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss with guest expert and Rheumatologist Dr. Sophia Weinmann about the complex and challenging diagnosis of Immune mediated Inflammatory Arthritis. "},{"name":"Season 1: Episode 3","headline":"Breaking down the diagnosis and management of Immune Hypophysitis","hosts":"Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss all things Immune Hypophysitis and all you need to know to get better at managing this complex toxicity","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394 "},{"name":"Season 1: Episode 2","headline":"Immune Related Thyroid Toxicities","hosts":"Join our hosts Dr. Afreen Shariff and Dr. Tian Zhang as they discuss challenges encountered in the diagnosis and management of commonly encountered Immune Related Thyroid Toxicities. ","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019?i=1000499264394","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I"},{"name":"Season 1: Episode 1 ","headline":"Immune Checkpoint Inhibitors have been transformative for cancer care. What have we learnt so far?","link_spotify":"https://open.spotify.com/show/11GGvT4Mk6IVelrJpXgY6I","link_apple":"https://podcasts.apple.com/us/podcast/checkpoint-now/id1541046019","hosts":"Dr. Afreen Shariff, MD, Endocrinologist, Duke Division of Endocrinology, Diabetes and Metabolism, Duke Cancer Institute; Dr. Tian Zhang, MD, MHS, Genito-Urinary Oncologist, Duke Cancer Institute"}]