{
  "link_title3": "citrusoncology.com ",
  "profilepic": "/images/professional-headshot.jpg",
  "body": "Dr. Afreen Shariff is an Endocrinologist, the Co-founder of Citrus Oncology and an Associate Professor of Medicine at the Duke University School of Medicine. Her clinical and research focus is in improving care for endocrine disorders in cancer patients. \n\nShe has a profound commitment to enhancing healthcare delivery and equity through value-based, patient-centric clinical and educational programs targeted at improving access and reducing health costs while managing complex oncology patients effectively. \n\nWith the mission to provide cancer warriors with incident and existing side effects from cancer drugs, the highest quality care through innovation, collaboration and compassion, Dr. Shariff has created and led several successful initiatives over the years. A few of these include, the Duke Endo Oncology Program, Cancer Therapy Toxicity Program, founding the Onco-Endocrinology Special Interest Group (SIG) through The Endocrine Society and creating a novel AI model to effectively predict hospitalizations from immunotherapy related adverse events up to 2 weeks in advance of the expected event. She is the recipient of the 2023 ACCC Innovator Award and Healio Disruptive Innovator Award 2024 for Clinical Innovation. In 2024, she Co-founded a virtual multi-specialty cancer support clinic- Citrus Oncology that enables patients and oncologists to take control of side effects from cancer drugs from the comfort of their home or offices. Visit citrusoncology.com for more information. \n\nTimely access, patient-provider-subspecialist education, care navigation and predicting and preventing hospital admissions from toxicities using AI powered clinical decision tools has been the focus of her career.  \n\nDr. Shariff decided to leverage the impact and outreach of podcasts as a medium to advance her educational mission and started Checkpoint NOW in 2020. \n",
  "name": "Afreen Idris Shariff, MD",
  "order": 1,
  "link_title": "Profile",
  "link2": "https://twitter.com/afreenshariffmd",
  "link3": "http://www.dukecancerinstitute.org/topics/afreen-shariff",
  "link": "https://scholars.duke.edu/person/afreen.shariff",
  "link_title2": "Twitter"
}