{
  "order": 3,
  "name": "Tian Zhang, MD, MHS (Former Host)",
  "body": "Tian Zhang, M.D., M.H.S., is an Associate Professor in the Department of Internal Medicine at UT Southwestern Medical Center. She specializes in the diagnosis and treatment of genitourinary malignancies, including kidney, prostate, bladder, and testicular cancers.\n\nDr. Zhang earned her medical degree from the Harvard-MIT Health Sciences and Technology (HST) program at Harvard Medical School. She completed a residency in internal medicine at Duke University, where she also received advanced training through a hematology-oncology fellowship. In addition, she earned a Master of Health Sciences in the Clinical Research Training Program at Duke in 2019.\n\nCertified by the American Board of Internal Medicine in medical oncology, she joined the UT Southwestern faculty in 2021. Dr. Zhang is a clinical trialist and translational researcher focused on evaluating clinical development of novel therapeutics and evaluating biomarkers for genitourinary malignancies. She partners closely with a multidisciplinary team at UT Southwestern to provide data-driven clinical care for her patients.\n\nShe has gained an international reputation developing clinical trials in kidney, prostate, and bladder cancers. She serves as the study chair for PDIGREE, a phase III trial in metastatic renal cell carcinoma.\n\nDr. Zhang is a member of several professional organizations, including the American Society of Clinical Oncology (ASCO), the American Association for Cancer Research (AACR), and the European Society for Medical Oncology (ESMO).\n\nShe serves on numerous committees, including as Co-chair of the National Cancer Institute Genitourinary (GU) Steering Committee Renal Task Force and as Chair of the Chinese American Hematologist and Oncologist Network (CAHON) Academic Committee. She is a member of several ASCO clinical management guidelines committees as well as the Alliance for Clinical Trials in Oncology, GU Oncology, and Immuno-Oncology Committees.\n\nShe brings a track record of research and mentoring to UT Southwestern. She has received multiple peer-reviewed grants, a Resident Research Mentoring Award from Duke, and, notably, the 2021 Cancer Prevention & Research Institute of Texas (CPRIT) Scholar Rising Stars Award.\n\nDr. Zhang was the co-host of Checkpoint NOW since its inception in 2020 till 2024. She was instrumental in creating the formative impact of the podcast and continues to be a great support and resource for Checkpoint NOW!",
  "link": "https://utswmed.org/doctors/tian-zhang/",
  "link_title": "Website",
  "link2": "@TiansterZhang",
  "link_title2": "X",
  "profilepic": "/images/tian-zhang-md.jpg"
}